In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [23]:
dic = {'city' : ['서울','부산','대전','대구','광주'],
      'year' : [2017,2017,2018,2018,2018],
      'temp' : [18,20,19,21,20]}
data = pd.DataFrame(dic) ; data

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2018    19
3   대구  2018    21
4   광주  2018    20

In [24]:
data.index=['a','b','c','d','e'] ;data

  city  year  temp
a   서울  2017    18
b   부산  2017    20
c   대전  2018    19
d   대구  2018    21
e   광주  2018    20

In [25]:
data.columns = ['도시','연도','날씨'];data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [26]:
data.도시

a    서울
b    부산
c    대전
d    대구
e    광주
Name: 도시, dtype: object

In [27]:
data['도시']

a    서울
b    부산
c    대전
d    대구
e    광주
Name: 도시, dtype: object

In [28]:
data.loc['a']

도시      서울
연도    2017
날씨      18
Name: a, dtype: object

In [29]:
data.set_index(['도시'])

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [30]:
data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [31]:
data = data.set_index(['도시']) ; data

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [33]:
data.set_index(['도시',inplace=True]);data

SyntaxError: invalid syntax (<ipython-input-33-277d0be85d27>, line 1)

In [34]:
data.loc['서울']

연도    2017
날씨      18
Name: 서울, dtype: int64

In [35]:
data

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [38]:
data.날씨

도시
서울    18
부산    20
대전    19
대구    21
광주    20
Name: 날씨, dtype: int64

In [39]:
data.iloc[1:3]

      연도  날씨
도시
부산  2017  20
대전  2018  19